ninety_nine_cats/app/controllers/cats_controller.rb

  def update
    @cat = Cat.find(params[:id])

    if @cat.update_attributes(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
UPDATE "cats" SET "description" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["description", "JK it's female (just like the future)"], ["updated_at", "2020-04-26 16:05:47.246759"], ["id", 14]]